notes/meeting_2021mar07.org
* meeting notes Mar 07, 2021


** announcments
*** richard hainsworth: alternative pod6 processing 
**** His version of Raku docs: http://raku.finanalyst.org

** the usual meeting links:
*** https://github.com/doomvox/raku-study/tree/main/bin/2021mar07
*** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021mar07.md


** "topics" (disorganized list of stuff I'm pretending belongs in a hierarchy)
*** lamberts regex problem, munging sudoers lines
**** david christensen variation: scripted solution
**** raku translation-- still has problems
*** jeff questions about compiler options, etc

*** the great "say Set.^methods" affair
**** the issue (bug report and discussion):
https://github.com/rakudo/rakudo/issues/4207

**** the roast test, aka the spec:
https://github.com/Raku/roast/blob/master/S12-introspection/methods.t
***** it checks the case of inheritence, but not roles

*** a stupid mistake that isn't: naming a method with a leading ^
**** https://stackoverflow.com/questions/54143036/class-method-name-with-doesnt-get-invoked-properly/54147131#54147131
***** should this generate a warning/error?
*** 69 cent tour of raku regexs
*** some simple grammar demos

** possible topics (carried over from earlier meetings)
*** Steven_lembark
**** https://www.slideshare.net/lembark/hypers-and-gathers-and-takes-oh-my
***** slide21:  "unit sub MAIN { ..."  unit?
**** https://www.slideshare.net/lembark/generating-querying-calendar-tables-in-posgresql
*** adverbs that control returns, e.g. :p for pairs (a feature Bruce Gray likes)
**** https://docs.raku.org/language/subscripts#index-entry-:p_(subscript_adverb)
*** andrew shitov "Perl 6 at a Glance"
**** https://andrewshitov.com/perl6-at-a-glance/
**** https://andrewshitov.com/wp-content/uploads/2020/01/Perl-6-at-a-Glance.pdf
*** perl weekly challenge: 
**** https://perlweeklychallenge.org/

*** promises and threads
**** https://www.reddit.com/r/rakulang/comments/lthpxe/are_promises_multithreaded/
**** Jonathan Worthington
***** https://github.com/Raku/CCR/blob/main/Remaster/Jonathan%20Worthington/Racing-to-writeness-to-wrongness-leads.md
***** https://github.com/Raku/CCR/blob/main/Remaster/Jonathan%20Worthington/A-unified-and-improved-Supply-concurrency-model.md

** linux kernel module to shut up damn bell

** bash books, much new features
*** bash          (d christensen pick)
*** bash cookbook (d christensen mention, weak writing)
*** unix shells (jeff pick)
*** "pro bash programming" by chris johnson, apress (alan pick)

*** book on the hidden logic of english:
**** "uncovering the logic of english" (jeff pick)
***** clusters of morphemes

*** humble bundle promotion: oreilley pocket references

*** bruce gray discussion
**** http://rosettacode.org/wiki/Modified_random_distribution#Raku

*** shadow novel where esperanto was spoken
***  "Crime Under Cover" (1941) by Maxwell Grant
****  http://obsidianrook.com/doomfiles/LA_OMBRO.html


















